{
  "courseInfo": {
    "courseCode": "4351108",
    "subcode": "4351108",
    "courseTitle": "OOPS & Python Programming",
    "subjectName": "OOPS & Python Programming",
    "semester": "5",
    "program": "Electronics & Communication Engineering",
    "branch": "Electronics & Communication Engineering",
    "level": "Diploma",
    "curriculum": "GTU - COGC-2021 Curriculum",
    "departmentId": "EC",
    "programId": "11",
    "departmentName": "Electronics & Communication Engineering",
    "programName": "Diploma in Electronics & Communication Engineering"
  },
  
  "teachingExamScheme": {
    "teachingScheme": {
      "lecture": 2,
      "lectureHours": 2,
      "tutorial": 0,
      "tutorialHours": 0,
      "practical": 2,
      "practicalHours": 2,
      "credits": 3
    },
    "examinationScheme": {
      "theoryESE": 70,
      "theoryEseMarks": 70,
      "theoryCA": 30,
      "theoryPaMarks": 30,
      "practicalCA": 25,
      "practicalPaMarks": 25,
      "practicalESE": 25,
      "practicalEseMarks": 25,
      "totalMarks": 150
    },
    "courseFlags": {
      "isElective": false,
      "isTheory": true,
      "theoryExamDuration": "3 hours",
      "isPractical": true,
      "practicalExamDuration": "4 hours",
      "isFunctional": false,
      "isSemiPractical": false
    }
  },

  "rationale": "A course on Object-Oriented Programming (OOPS) and Python Programming can be beneficial for students as it covers basic and advanced programming concepts and provides a foundation for software development. The course covers a variety of topics, including basic programming concepts, advanced OOPS concepts. Additionally, the course can provide best practices and tips for writing Python code, debugging, and testing code, and avoiding common mistakes. Overall, the course can equip students with the skills and knowledge needed to succeed in a variety of programming roles.",
  
  "competency": "Develop program using Object-Oriented Python Programming (OOPS) to solve given problem.",
  
  "courseOutcomes": [
    {
      "id": "CO1",
      "description": "Demonstrate proficiency in Python programming fundamentals, including data types, control structures, loops, input-output functions."
    },
    {
      "id": "CO2", 
      "description": "Develop python programs by applying data structures – list, dictionary, tuple, set and strings concepts."
    },
    {
      "id": "CO3",
      "description": "Design Python functions and modules."
    },
    {
      "id": "CO4",
      "description": "Apply object-oriented programming principles using Python."
    }
  ],

  "practicalExercises": [
    {
      "srNo": 1,
      "description": "Install & configure python software.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 2,
      "description": "(A) Create a program to print your name, mobile number, and date of birth.\n(B) Create a program to print following sentence.\nJohn said, \"There's an elephant outside the window.\"",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 3,
      "description": "(A) Create a program to read three numbers from the user and find the average of the numbers.\n(B) Create a program to convert temperature from Fahrenheit to Celsius unit using eq: C=(F-32)/1.8\n(C) Create a program that can calculate simple interest and compound interest on given data.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 4,
      "description": "(A) Create a program to identify whether the scanned number is even or odd and print an appropriate message.\n(B) Create a program to find a maximum number among the given three numbers.\n(C) A year is a leap year if it is divisible by 4, except that years divisible by 100 are not leap years unless they are also divisible by 400. Create a program that asks the user for a year and prints out whether it is a leap year or not.\n(D) Suppose that scores 90 and above are A grade, scores in the 80s are B grade, 70s are C grade, 60s are D grade, and anything below 60 is an F grade. Create a program to find grade according to scores entered by user.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 5,
      "description": "(A) Create a python program to print 1 to 10 numbers using loops.\n(B) Create a program to find the sum of all the positive numbers entered by the user. As soon as the user enters a negative number, stop taking in any further input from the user and display the sum.\n(C) Create a program to display the following patterns.\n1     * * * * *\n2 2   * * * *\n3 3 3 * * *\n4 4 4 4 * *\n5 5 5 5 5 *\n(D) Create a program to print prime numbers between 1 to N.",
      "unitNo": "I", 
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 6,
      "description": "(A) Create a program to find sum of all elements in a list using for loop.\n(B) Create a program to increment each element of list by one.\n(C) Create a program to check if an element exists in a given list.\n(D) Given a list saved in variable: a = [1, 4, 9, 16, 25, 36,49, 64, 81, 100]. Write one line of Python that takes this list and makes a new list that has only the even elements of this list in it.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 7,
      "description": "(A) Write a program to input names of n employees and store them in a tuple. Also, input a name from the user and find if this employee is present in the tuple or not.\n(B) Write a program to read email IDs of n number of students and store them in a tuple. Create two new tuples, one to store only the usernames from the email IDs and second to store domain names from the email ids. Print all three tuples at the end of the program.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 8,
      "description": "Write a Program to create three sets A={1,5,6,3,7}, B={1,8},C={9,3,5,6} and perform following operations.\n(1) Add two elements 3 and 4 to set B.\n(2) Remove 9 from set C\n(3) Find union of A and C\n(4) Find intersection of A and B\n(5) Find difference and symmetric difference of A and C\n(6) Check if set A and B are disjoint or not\n(7) Check if A is subset of C or not\n(8) Check if B is superset of A or not",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 9,
      "description": "(A) Create a dictionary with the roll number, name, and marks of n students in a class and display the names of students who have scored marks above 75.\n(B) Write a program to count the number of times a character appears in a given string using a dictionary.\n(C) Write a user-defined function to convert a number entered by the user into its corresponding number in words. For example, if the input is 789 then the output should be 'Seven Eight Nine'",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 10,
      "description": "(A) Write a program to find the length of a string excluding spaces.\n(B) Write a program that asks the user for a string and prints out the location of each 'a' in the string.\n(C) Write a program to input a string from the user and print it in the reverse order without creating a new string.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 11,
      "description": "(A) Create a user-defined function to print the Fibonacci series of 0 to N numbers. (Where N is an integer number and passed as an argument)\n(B) Create user-defined function to check if given number is prime or not.\n(C) Create user defined function to check if given string is palindrome or not.\n(D) Create a program to define a module to find the area and circumference of a circle.\ni. import the module to another program.\nii. import a specific function from a module to another program.\n(E) Write a program to plot sine and cosine wave in one plot using numpy and matplotlib module.",
      "unitNo": "III",
      "hours": 4,
      "isCompulsory": false
    },
    {
      "srNo": 12,
      "description": "(A) Design a class Complex for adding the two complex numbers and also show the use of constructor.\n(B) Design a class for single level inheritance using public and private type derivation.\n(C) Write a Python program to demonstrate method overriding using inheritance.\n(D) Implement multiple and hierarchical inheritance.",
      "unitNo": "IV",
      "hours": 4,
      "isCompulsory": false
    }
  ],

  "performanceIndicators": [
    {
      "indicator": "Identify suitable approach to implement logic",
      "weightage": 25
    },
    {
      "indicator": "Use pre-built packages/functions",
      "weightage": 20
    },
    {
      "indicator": "Use python concepts to implement efficient program",
      "weightage": 25
    },
    {
      "indicator": "Follow different input test cases to check output",
      "weightage": 10
    },
    {
      "indicator": "Identify and mend coding errors in a program / Interpret the result and conclude",
      "weightage": 20
    }
  ],
  
  "equipment": {
    "hardware": [
      "Computer system with operating system: Windows 7 or higher Ver., macOS, and Linux, with 4GB or higher RAM, Python versions: 3.7.X"
    ],
    "software": [
      "Python IDEs and Code Editors",
      "Open Source : IDLE/PyCharm/Spyder/Jupyter"
    ]
  },

  "affectiveDomainOutcomes": [
    "Work as a leader/a team member (while doing a micro-project)",
    "Follow safety practices",
    "Maintain tools and equipments",
    "Adhere to ethical practices"
  ],
  
  "underpinningTheory": [
    {
      "unitNumber": "I",
      "unitTitle": "Basics of Python",
      "unitOutcomes": [
        {
          "id": "1.a",
          "description": "Install and configure Python."
        },
        {
          "id": "1.b",
          "description": "Describe the different data types available in Python and use them."
        },
        {
          "id": "1.c",
          "description": "Convert between different data types using type casting in Python."
        },
        {
          "id": "1.d",
          "description": "Describe the need for control structures in programming."
        },
        {
          "id": "1.e",
          "description": "Use decision making structures, different types of loop, break, continue and pass statements."
        }
      ],
      "topics": [
        {
          "topicNumber": "1.1",
          "title": "Introduction to Python, Python Features, Python Applications"
        },
        {
          "topicNumber": "1.2", 
          "title": "Installing Python"
        },
        {
          "topicNumber": "1.3",
          "title": "Basic Structure of Python Program, Keywords, Identifiers, Data types, Variables, Operators, Type Casting"
        },
        {
          "topicNumber": "1.4",
          "title": "Input-Output functions: input, print"
        },
        {
          "topicNumber": "1.5",
          "title": "Introduction to Control Structures"
        },
        {
          "topicNumber": "1.6",
          "title": "Decision Making Structures: if, if-else statements, Nested if-else and if-elif-else statements"
        },
        {
          "topicNumber": "1.7",
          "title": "Loops : for loop, while loop, Nested loops"
        },
        {
          "topicNumber": "1.8",
          "title": "break, continue and pass statements"
        }
      ]
    },
    {
      "unitNumber": "II",
      "unitTitle": "Lists, Tuples, Sets, Dictionaries and String",
      "unitOutcomes": [
        {
          "id": "2.a",
          "description": "Develop programs using lists, tuples, sets, dictionaries, and string."
        },
        {
          "id": "2.b",
          "description": "Use various operations on lists, tuples, sets, dictionaries, and string."
        }
      ],
      "topics": [
        {
          "topicNumber": "2.1",
          "title": "Lists and operations on Lists"
        },
        {
          "topicNumber": "2.2",
          "title": "Tuples and operations on Tuples"
        },
        {
          "topicNumber": "2.3",
          "title": "Sets and operations on Sets"
        },
        {
          "topicNumber": "2.4",
          "title": "Dictionaries and operations on Dictionaries"
        },
        {
          "topicNumber": "2.5",
          "title": "String and operations on strings"
        }
      ]
    },
    {
      "unitNumber": "III",
      "unitTitle": "Functions and Modules",
      "unitOutcomes": [
        {
          "id": "3.a",
          "description": "Create user-defined functions in Python."
        },
        {
          "id": "3.b",
          "description": "Explain the concepts of global and local variables in Python."
        },
        {
          "id": "3.c",
          "description": "Use math, random and statistics module in programs."
        },
        {
          "id": "3.d",
          "description": "Create and import user-defined modules in Python."
        }
      ],
      "topics": [
        {
          "topicNumber": "3.1",
          "title": "Introduction to Functions -User defined functions -Arguments and Parameters"
        },
        {
          "topicNumber": "3.2",
          "title": "Scope of Variable: Global and Local Variable"
        },
        {
          "topicNumber": "3.3",
          "title": "Module: math, random, statistics"
        },
        {
          "topicNumber": "3.4",
          "title": "Creating user defined module"
        }
      ]
    },
    {
      "unitNumber": "IV",
      "unitTitle": "Object Oriented Programming",
      "unitOutcomes": [
        {
          "id": "4.a",
          "description": "Define Object-Oriented Programming and its importance in Python."
        },
        {
          "id": "4.b",
          "description": "Create objects from a class in Python."
        },
        {
          "id": "4.c",
          "description": "Explain the difference between these types of methods and when to use each of them."
        },
        {
          "id": "4.d",
          "description": "Use encapsulation to hide the implementation details of a class from the user."
        },
        {
          "id": "4.e",
          "description": "Implement single, multiple, multi-level, hierarchical, and hybrid inheritance in Python programs."
        },
        {
          "id": "4.f",
          "description": "Use polymorphism to write flexible and reusable code in Python."
        }
      ],
      "topics": [
        {
          "topicNumber": "4.1",
          "title": "Oops Concepts"
        },
        {
          "topicNumber": "4.2",
          "title": "Class and Objects"
        },
        {
          "topicNumber": "4.3",
          "title": "Constructors"
        },
        {
          "topicNumber": "4.4",
          "title": "Types of methods:Instance method, Class method, static method"
        },
        {
          "topicNumber": "4.5",
          "title": "Data Encapsulation"
        },
        {
          "topicNumber": "4.6",
          "title": "Inheritance- single, multiple, multi level, hierarchical, hybrid"
        },
        {
          "topicNumber": "4.7",
          "title": "Polymorphism through inheritance"
        },
        {
          "topicNumber": "4.8",
          "title": "Abstraction- abstract class"
        }
      ]
    }
  ],

  "specificationTable": [
    {
      "unitNo": "I",
      "unitTitle": "Basics of Python",
      "teachingHours": 7,
      "rememberLevel": 6,
      "understandLevel": 7,
      "applyLevel": 5,
      "totalMarks": 18
    },
    {
      "unitNo": "II", 
      "unitTitle": "Lists, Tuples, Sets, Dictionaries and String",
      "teachingHours": 10,
      "rememberLevel": 9,
      "understandLevel": 9,
      "applyLevel": 7,
      "totalMarks": 25
    },
    {
      "unitNo": "III",
      "unitTitle": "Functions and Modules",
      "teachingHours": 5,
      "rememberLevel": 3,
      "understandLevel": 3,
      "applyLevel": 4,
      "totalMarks": 10
    },
    {
      "unitNo": "IV",
      "unitTitle": "Object Oriented Programming",
      "teachingHours": 6,
      "rememberLevel": 6,
      "understandLevel": 6,
      "applyLevel": 5,
      "totalMarks": 17
    }
  ],
  
  "studentActivities": [
    "Undertake micro-projects in teams",
    "Give a seminar on any relevant topics",
    "Participate in online coding challenges and hackathons to improve programming skills in Python",
    "Make a list of the Python-based applications or software",
    "Students are encouraged to register themselves in various MOOCs such as: Swayam, edx, Coursera, Udemy, Sololearn etc. to further enhance their learning"
  ],
  
  "instructionalStrategies": [
    "Massive open online courses (MOOCs) may be used to teach various topics/subtopics",
    "Guide student(s) in undertaking micro-projects",
    "'L' in section No. 4 means different types of teaching methods that are to be employed by teachers to develop the outcomes",
    "Code reviews: Conduct code reviews to provide feedback to students on their coding skills. This will help them to identify areas where they need to improve and also learn best practices from their peers",
    "Online resources: Provide students with access to online resources, such as tutorials, videos, and forums, that will help them to deepen their understanding of Python concepts and also provide them with additional practice opportunities"
  ],
  
  "microProjects": [
    {
      "title": "Simple Game Simulation",
      "description": "Develop a program to simulate a simple game using control structures, functions, and OOP concepts"
    },
    {
      "title": "Student Database Management",
      "description": "Create a program to manage a student database using dictionaries, lists, and functions"
    },
    {
      "title": "Statistical Data Calculator",
      "description": "Develop a program to calculate statistics on a dataset using modules and functions"
    },
    {
      "title": "Object-Oriented Calculator",
      "description": "Implement a simple calculator using OOP concepts, including inheritance and polymorphism"
    },
    {
      "title": "Text Data Analyzer",
      "description": "Build a program to analyze text data using string operations, sets, and dictionaries"
    },
    {
      "title": "Image Processing Tool",
      "description": "Create a program to perform image processing using modules and functions"
    },
    {
      "title": "Banking System Simulator",
      "description": "Develop a program to simulate a simple banking system using OOP concepts, including encapsulation and inheritance"
    },
    {
      "title": "Inventory Management System",
      "description": "Implement a program to manage a simple inventory system using lists and dictionaries"
    },
    {
      "title": "Password Generator and Manager",
      "description": "Create a program to generate and manage passwords using string operations and modules"
    },
    {
      "title": "Sorting Algorithm Implementation",
      "description": "Build a program to implement various sorting algorithms using functions and OOP concepts"
    },
    {
      "title": "Weather Data Visualization",
      "description": "Develop a tool that reads weather data from a file, such as a CSV, and creates graphical representations of the data using libraries such as Matplotlib. (for data visit https://open-meteo.com/, https://www.visualcrossing.com/weather-api etc) Weather Data Analytics: Build a program that analyzes large sets of weather data, such as historical temperature, wind speed, and precipitation data, and identifies patterns and trends. (for data visit https://open-meteo.com/, https://www.visualcrossing.com/weather-api etc)"
    },
    {
      "title": "Air Quality Monitoring",
      "description": "Develop a tool that retrieves air quality data from APIs, stores it in a database, and displays the data using charts and graphs. (for data visit https://data.gov.in/catalog/historical-daily-ambient-air-quality-data etc)"
    }
  ],
  
  "learningResources": {
    "books": [
      {
        "srNo": 1,
        "title": "Python Basics: A Practical Introduction to Python 3",
        "author": "David Amos, Dan Bader et. al.",
        "publication": "Real Python, 2021",
        "isbn": "9781775093329"
      },
      {
        "srNo": 2,
        "title": "Beginning Python",
        "author": "James Payne",
        "publication": "Wiley, 2010",
        "isbn": "9780470414637"
      },
      {
        "srNo": 3,
        "title": "Python Programming: An Introduction to Computer Science",
        "author": "John Zelle",
        "publication": "Franklin, Beedle & Associates Inc; Pap/Cdr edition (1 December 2003)",
        "isbn": "1590280288, 978-1887902991"
      },
      {
        "srNo": 4,
        "title": "Introduction to Problem Solving with Python",
        "author": "E. Balagurusamy",
        "publication": "Mc Graw Hill India, New Delhi, 2017",
        "isbn": "9789352602582"
      },
      {
        "srNo": 5,
        "title": "Python 3 Object Oriented Programming",
        "author": "Dusty Philips",
        "publication": "PACKT Publishing 2010",
        "isbn": "978-1-849511-26-1"
      }
    ],
    "websites": [
      {
        "title": "Python Official Website",
        "url": "https://www.python.org/",
        "type": "Official Documentation"
      },
      {
        "title": "SoloLearn",
        "url": "https://www.sololearn.com/",
        "type": "Learning Platform"
      },
      {
        "title": "Real Python",
        "url": "https://realpython.com/",
        "type": "Tutorial Website"
      },
      {
        "title": "NPTEL Course 106106182",
        "url": "https://nptel.ac.in/courses/106106182",
        "type": "MOOC"
      },
      {
        "title": "NPTEL Course 106106145",
        "url": "https://nptel.ac.in/courses/106106145",
        "type": "MOOC"
      },
      {
        "title": "W3Schools Python",
        "url": "https://www.w3schools.com/python/",
        "type": "Tutorial Website"
      },
      {
        "title": "Python Tutorial Video",
        "url": "https://www.youtube.com/watch?v=_uQrJ0TkZlc",
        "type": "Video Tutorial"
      }
    ]
  },
  
  "competencyMapping": {
    "programOutcomes": [
      {
        "poNumber": "PO1",
        "description": "Basic & Discipline specific knowledge"
      },
      {
        "poNumber": "PO2",
        "description": "Problem Analysis"
      },
      {
        "poNumber": "PO3",
        "description": "Design/development of solution"
      },
      {
        "poNumber": "PO4",
        "description": "Engineering Tools, Experimentation & Testing"
      },
      {
        "poNumber": "PO5",
        "description": "Engineering practices for society, sustainability & environment"
      },
      {
        "poNumber": "PO6",
        "description": "Project Management"
      },
      {
        "poNumber": "PO7",
        "description": "Life-long learning"
      }
    ],
    "mapping": [
      {
        "courseOutcome": "CO1",
        "poMappings": {
          "PO1": 3,
          "PO2": 2,
          "PO3": 1,
          "PO4": 1,
          "PO5": 0,
          "PO6": 1,
          "PO7": 2
        }
      },
      {
        "courseOutcome": "CO2",
        "poMappings": {
          "PO1": 2,
          "PO2": 3,
          "PO3": 2,
          "PO4": 2,
          "PO5": 0,
          "PO6": 2,
          "PO7": 3
        }
      },
      {
        "courseOutcome": "CO3",
        "poMappings": {
          "PO1": 2,
          "PO2": 1,
          "PO3": 3,
          "PO4": 2,
          "PO5": 0,
          "PO6": 1,
          "PO7": 3
        }
      },
      {
        "courseOutcome": "CO4",
        "poMappings": {
          "PO1": 2,
          "PO2": 2,
          "PO3": 2,
          "PO4": 2,
          "PO5": 0,
          "PO6": 1,
          "PO7": 2
        }
      }
    ]
  },
  
  "developmentCommittee": [
    {
      "name": "Dr. S N Sampat",
      "designation": "HOD",
      "institute": "L E College (Diploma)Morbi",
      "contact": "-",
      "email": "snsampat@gmail.com"
    },
    {
      "name": "Mr. Ashish M Patel",
      "designation": "Lecturer",
      "institute": "Government Polytechnic for Girls, Surat",
      "contact": "-",
      "email": "gpgsecamp@gmail.com"
    },
    {
      "name": "Dr. A S Pandya",
      "designation": "Principal BoS Chairman Electrical & Allied Branches",
      "institute": "BPTI, Bhavnagar",
      "contact": "9426201171",
      "email": "aspandya22@rediffmail.com"
    },
    {
      "name": "Shri U V Buch",
      "designation": "LEC BoS Member & Branch Coordinator-EC",
      "institute": "GP A'bad",
      "contact": "9825346922",
      "email": "uvbuch@gmail.com"
    }
  ],
  
  "metadata": {
    "syllabusFormat": "old",
    "curriculumVersion": "COGC-2021",
    "gtuSyllabusUrl": "http://syllabus.gtu.ac.in/",
    "version": "1.0",
    "createdAt": "2025-09-09T12:00:00Z",
    "id": "4351108",
    "subjectCode": "4351108"
  }
}