{
  "courseInfo": {
    "courseCode": "DI03016011",
    "subcode": "DI03016011",
    "courseTitle": "Digital Marketing",
    "subjectName": "Digital Marketing",
    "semester": "3",
    "program": "Diploma in Engineering",
    "branch": "Information Technology",
    "level": "Diploma",
    "academicYear": "2024-25",
    "category": "ESC",
    "prerequisite": "Students should have a basic understanding of internet usage, web technologies, and social media platforms, along with familiarity with computer applications and online communication tools. While prior knowledge of basic programming, web development (HTML, CSS), and data analysis can be beneficial for advanced topics like SEO and web analytics, it is not mandatory.",
    "departmentId": "",
    "programId": "",
    "departmentName": "Information Technology",
    "programName": "Diploma in Engineering"
  },
  "teachingExamScheme": {
    "teachingScheme": {
      "lecture": 2,
      "lectureHours": 2,
      "tutorial": 0,
      "tutorialHours": 0,
      "practical": 2,
      "practicalHours": 2,
      "credits": 3
    },
    "examinationScheme": {
      "theoryESE": 70,
      "theoryEseMarks": 70,
      "theoryCA": 30,
      "theoryPaMarks": 30,
      "practicalCA": 20,
      "practicalPaMarks": 20,
      "practicalESE": 30,
      "practicalEseMarks": 30,
      "totalMarks": 150
    },
    "courseFlags": {
      "isElective": false,
      "isTheory": true,
      "theoryExamDuration": "",
      "isPractical": true,
      "practicalExamDuration": "",
      "isFunctional": false,
      "isSemiPractical": false
    }
  },
  "rationale": "The explosive growth of internet and mobile phone usage has fundamentally reshaped the communication landscape, creating unprecedented opportunities for both individuals and organizations. In today's digitally interconnected world, digital marketing has become an indispensable strategy, replacing traditional approaches. This course recognizes the critical need to equip students with the essential knowledge and skills to navigate this dynamic environment. The ability to leverage online platforms effectively is no longer a luxury, but a necessity. Businesses across all sectors are actively seeking professionals with expertise in digital marketing to drive growth, enhance brand visibility, and engage with target audiences. This course provides a comprehensive exploration of core digital marketing concepts, including digital marketing platforms, search engine optimization (SEO), web analytics, social media marketing, and email marketing. Students will gain practical experience in formulating integrated digital marketing strategies and utilizing relevant tools. Furthermore, this course emphasizes the importance of data-driven decision-making by teaching students how to measure the effectiveness of digital campaigns using various analytical tools. By mastering these skills, students will be well-prepared to meet the demands of the modern job market and contribute to the success of organizations in the digital age. In a rapidly evolving digital landscape, understanding and implementing effective digital marketing strategies is not just advantageous, it is essential for future success.",
  "courseOutcomes": [
    {
      "id": "CO1",
      "description": "Explain the role of Digital Marketing in the rapidly changing digital landscape.",
      "rbtLevel": "U",
      "bloomLevel": "Understand"
    },
    {
      "id": "CO2",
      "description": "Apply various SEO techniques including on-page, off-page, and technical optimization to improve website ranking and visibility on search engines.",
      "rbtLevel": "A",
      "bloomLevel": "Apply"
    },
    {
      "id": "CO3",
      "description": "Use website analytics to improve the conversion rate.",
      "rbtLevel": "A",
      "bloomLevel": "Apply"
    },
    {
      "id": "CO4",
      "description": "Apply social media and video marketing tools to promote brands across platforms like Meta and Twitter(X).",
      "rbtLevel": "A",
      "bloomLevel": "Apply"
    },
    {
      "id": "CO5",
      "description": "Explain the principles of Email Marketing and Search Engine Marketing (SEM), and classify their types, campaign strategies, and key performance indicators.",
      "rbtLevel": "U",
      "bloomLevel": "Understand"
    }
  ],
  "courseContent": [
    {
      "unitNumber": "1",
      "unitTitle": "Introduction to Digital Marketing",
      "content": [
        "1.1 Fundamentals of Digital Marketing",
        "▪ Definition, scope, and significance",
        "▪ Traditional vs. Digital Marketing: Key differences and advantages",
        "1.2 Evolution and Growth of Digital Marketing",
        "▪ Milestones in digital marketing",
        "▪ Impact of mobile technology, AI, and automation",
        "1.3 Digital Marketing Strategies: P.O.E.M. Framework",
        "1.4 Digital Marketing Planning & Execution",
        "▪ Identifying target audience & market research",
        "▪ Steps to create a digital marketing plan",
        "▪ Setting objectives, selecting digital channels, and measuring success",
        "1.5 Latest Trends in Digital Marketing",
        "▪ AI-powered marketing (chatbots, personalized recommendations)",
        "▪ Voice search & conversational AI (Alexa, Siri)",
        "▪ Short-form video dominance (Instagram Reels, TikTok, YouTube Shorts)",
        "▪ Metaverse, AR/VR marketing, and immersive brand experiences",
        "▪ Zero-click searches & featured snippets in SEO",
        "1.6 Ethical Considerations & Data Privacy in Digital Marketing",
        "▪ Importance of ethical marketing practices",
        "▪ Overview of global data protection laws: GDPR (Europe), CCPA (USA), DPDP Act (India)",
        "▪ Impact of Data Protection Laws on Digital Campaigns (First-party data strategies, cookie-less tracking, consent-based marketing)"
      ],
      "hours": 7,
      "weightage": 20
    },
    {
      "unitNumber": "2",
      "unitTitle": "Introduction to Search Engine Optimization (SEO)",
      "content": [
        "2.1 Introduction to SEO",
        "▪ Overview of SEO",
        "▪ Importance and need of SEO in digital marketing",
        "▪ How Search Engines Work?",
        "2.2 SEO Methods and Tactics",
        "▪ White Hat SEO",
        "▪ Black Hat SEO",
        "2.3 SEO Optimization Techniques",
        "▪ On-page optimization",
        "▪ Off-page optimization",
        "▪ Technical SEO",
        "2.4 Search Engine Ranking",
        "▪ What is SEO ranking",
        "▪ Important Factors for SEO ranking",
        "▪ Techniques to Improve Rankings",
        "2.5 Role of social media in SEO"
      ],
      "hours": 8,
      "weightage": 24
    },
    {
      "unitNumber": "3",
      "unitTitle": "Introduction to web analytics",
      "content": [
        "3.1 Data collection, Weblogs & Page tagging, Key metrics",
        "▪ Unique visitors, Pageviews, Pages/visit, Avg Visit Duration, Bounce rate, New Visits",
        "3.2 Types of web analytics Tools",
        "▪ Content analytics tools, Customer analytics tools, Usability (UX) analytics tools, A/B and multivariate testing tools, SEO analytics tools, General enterprise analytics tools, Open-source web analytics tools, Product analytics tools",
        "3.3 Setting up goals and conversion rate, goal reports in Google Analytics (GA4)",
        "3.4 multi-touch attribution models: Linear, Time decay",
        "3.5 Google Tag Manager"
      ],
      "hours": 6,
      "weightage": 22
    },
    {
      "unitNumber": "4",
      "unitTitle": "Introduction to social media marketing",
      "content": [
        "4.1 Introduction to social media marketing",
        "▪ importance and benefits of social media marketing",
        "▪ Types of social media marketing",
        "▪ Building a better Social Media Marketing Strategy",
        "4.2 Introduction to Meta Platform Marketing",
        "▪ Types of Meta ads: Carousel Ads, Story Ads, Lead Generation Ads, Video Ads",
        "▪ Use of \"Insights\" under Meta Business Suite",
        "4.3 Twitter(X) for business",
        "▪ Hashtags, customer service, live tweets",
        "▪ Twitter advertising: promoted tweets, promoted accounts, trends",
        "4.4 Video Marketing",
        "▪ Types of marketing videos: Explainer video, educational video, Animation video, Brand, Testimonial, Demo, 360° video, Augmented Reality (AR) video",
        "▪ Best practices in video marketing"
      ],
      "hours": 5,
      "weightage": 18
    },
    {
      "unitNumber": "5",
      "unitTitle": "Digital Promotions",
      "content": [
        "5.1 Introduction to Email Marketing",
        "▪ Importance of Email Marketing",
        "▪ Types of Emails for Marketing",
        "▪ Creating a basic Email marketing campaign",
        "▪ Email marketing analytics - Open Rate, Click-Through Rate (CTR), Unsubscribe Rate, Delivery & Bounce Rate",
        "5.2 Introduction to SEM",
        "▪ PPC (pay-per-click) vs SEO",
        "▪ Importance of SEM",
        "▪ Types of SEM Campaigns - Search Ads, Display Ads, Shopping Ads, Paid Video Ads, Local Service Ads, App Ads, Social Media Ads",
        "▪ Ad Extensions",
        "▪ Key SEM metrics - Impressions, Clicks, Conversion Rate, Cost per Click (CPC), Click-Through Rate (CTR), Quality Score, Cost per Conversion, Bounce Rate, Return on ad spend (ROAS), Ad Position (Avg. Position)"
      ],
      "hours": 4,
      "weightage": 16
    }
  ],
  "practicalOutcomes": [
    {
      "srNo": 1,
      "outcome": "Select a well-known brand (e.g., Nike, Amazon, Coca-Cola) and identify its digital marketing efforts. Categorize the brand's marketing strategies into Paid Media, Owned Media, and Earned Media. Prepare a report explaining each media type with examples from the selected brand.",
      "unitNo": "I",
      "hours": 2
    },
    {
      "srNo": 2,
      "outcome": "Imagine you are launching a new product - an eco-friendly notebook made from 100% recycled paper. Use any free SERP simulator tool such as https://popupsmart.com/tools/serp-preview-tool/ to create and check the SERP snippet preview for your product page. Write a suitable title tag (maximum 60 characters) and meta description (maximum 160 characters) that includes important keywords like 'eco-friendly,' 'notebook,' and 'recycled paper.' Also write a short product description (2-3 lines) using SEO best practices.",
      "unitNo": "II",
      "hours": 2
    },
    {
      "srNo": 3,
      "outcome": "Choose any two commercial or business websites of your choice. Use free SEO audit tools such as SEOptimer, Ubersuggest, Sitechecker, or Ahrefs Webmaster Tools to evaluate key On-Page SEO elements like title tags, meta descriptions, keyword usage, mobile-friendliness, page loading speed, and structured data. Also review Off-Page SEO factors such as backlinks, domain authority, and referring domains. Prepare a short report summarizing the SEO strengths and areas for improvement for both websites.",
      "unitNo": "II",
      "hours": 2
    },
    {
      "srNo": 4,
      "outcome": "Choose any website and test its page speed and mobile-friendliness using tools like Google PageSpeed Insights or GTmetrix. Prepare a report on both desktop and mobile results, note the performance score, loading time, and any improvement suggestions.",
      "unitNo": "II",
      "hours": 2
    },
    {
      "srNo": 5,
      "outcome": "Consider a product to sell online. Create a sample Google website (single page) with images and proper product description (product name, price, quantity, features etc.).",
      "unitNo": "III",
      "hours": 4
    },
    {
      "srNo": 6,
      "outcome": "Connect the created Google website with Google Analytics account and give a proper analytic matrix. (Unique visitors, Pageview, Avg visit duration, new visits)",
      "unitNo": "III",
      "hours": 2
    },
    {
      "srNo": 7,
      "outcome": "Design infographics, ads, covers, and posts for your product's social media marketing using Canva or any other tool.",
      "unitNo": "IV",
      "hours": 4
    },
    {
      "srNo": 8,
      "outcome": "Create an engaging video of your product using Loom or any other tool and share it on social media. (https://www.loom.com/)",
      "unitNo": "IV",
      "hours": 4
    },
    {
      "srNo": 9,
      "outcome": "Upload the video of your product created in previous practical on your YouTube account. Observe the YouTube Channel analytics (View, Impressions, Average view duration, Unique viewers, Subscribers).",
      "unitNo": "IV",
      "hours": 2
    },
    {
      "srNo": 10,
      "outcome": "Create an email marketing campaign for a local bakery's seasonal menu using Mailchimp or SendGrid. Analyze the campaign's performance using Open Rate, CTR, and Bounce Rate through the platform's analytics. Suggest improvements based on the results to enhance engagement.",
      "unitNo": "V",
      "hours": 4
    },
    {
      "srNo": 11,
      "outcome": "Using the Google Ads Preview Tool (NordicClick) or Andrew Marketing's Ad Preview Tool, create a mockup of a Google Search Ad for a travel agency promoting vacation packages. The goal is to design an ad targeting specific travel deals and see how it would appear in Google search results.",
      "unitNo": "V",
      "hours": 2
    }
  ],
  "specificationTable": [
    {
      "unitNo": "Combined",
      "unitTitle": "Theory Marks Distribution",
      "teachingHours": 30,
      "rememberLevel": 35,
      "understandLevel": 40,
      "applyLevel": 25,
      "analyzeLevel": 0,
      "evaluateLevel": 0,
      "createLevel": 0,
      "totalMarks": 100
    }
  ],
  "laboratoryResources": [
    {
      "srNo": 1,
      "resourceName": "Computer system with an operating system and Internet Facility",
      "specifications": "",
      "applicableTo": "All"
    },
    {
      "srNo": 2,
      "resourceName": "SERP Simulator Tool",
      "specifications": "https://popupsmart.com/tools/serp-preview-tool/",
      "applicableTo": "2"
    },
    {
      "srNo": 3,
      "resourceName": "SEO Audit Tools",
      "specifications": "SEOptimer, Ubersuggest, Sitechecker, or Ahrefs Webmaster Tools",
      "applicableTo": "3"
    },
    {
      "srNo": 4,
      "resourceName": "Google Tag Manager",
      "specifications": "",
      "applicableTo": "6"
    },
    {
      "srNo": 5,
      "resourceName": "Email Marketing Platforms",
      "specifications": "https://sendgrid.com/, https://mailchimp.com/",
      "applicableTo": "10"
    },
    {
      "srNo": 6,
      "resourceName": "Google Ads Preview Tool",
      "specifications": "https://nordicclick.com/resources/google-ads-preview-tool/, https://andrew.marketing/ad-preview-tool/",
      "applicableTo": "11"
    }
  ],
  "studentActivities": [
    "Undertake micro-projects in teams focusing on real-world digital marketing applications such as SEO audits, social media campaigns, or paid advertising strategies.",
    "Prepare charts or mind maps to explain digital marketing concepts, frameworks, or processes in a visually engaging manner.",
    "Create infographics, posters, social media content, certificates, or banners to promote college activities and events, applying real-world digital marketing techniques.",
    "Enroll in online courses and certifications on platforms like Swayam, edX, Coursera, Udemy, and LinkedIn Learning to expand their knowledge and earn certifications in digital marketing.",
    "Develop and manage a blog, website, or social media page for their college, department, or student club to promote activities, engage the audience, and apply digital marketing strategies.",
    "Analyze successful digital marketing campaigns by well-known brands and prepare a case study on their strategies, content, and audience engagement.",
    "Participate in digital marketing competitions or hackathons organized by colleges, universities, or online platforms to gain practical exposure.",
    "Conduct surveys or interviews with local businesses or startups to understand their digital marketing challenges and propose solutions.",
    "Collaborate with local businesses to manage their social media presence, run small-scale marketing campaigns, or optimize their website for search engines.",
    "Experiment with Google Ads or Facebook Ads Manager (on a small budget or using ad simulators) to understand ad creation, targeting, and performance tracking."
  ],
  "learningResources": {
    "books": [
      {
        "srNo": 1,
        "title": "Digital Marketing",
        "author": "Seema Gupta",
        "publication": "McGraw Hill, 3rd Edition",
        "isbn": "935532040X · 9789355320407"
      },
      {
        "srNo": 2,
        "title": "The Art of Digital Marketing: The Definitive Guide to Creating Strategic, Targeted, and Measurable Online Campaigns",
        "author": "Ian Dodson",
        "publication": "Wiley Publication, May 2016",
        "isbn": "978-1-119-26570-2"
      },
      {
        "srNo": 3,
        "title": "Fundamentals of Digital Marketing",
        "author": "Puneet Singh Bhatia",
        "publication": "Pearson 2nd Edition - 2019",
        "isbn": ""
      },
      {
        "srNo": 4,
        "title": "Understanding digital marketing strategies for online success",
        "author": "Dishek J. Mankad",
        "publication": "BPB Publications (August 26, 2019)",
        "isbn": ""
      },
      {
        "srNo": 5,
        "title": "eMarketing: The Essential Guide to Marketing in a Digital World",
        "author": "Rob Stokes",
        "publication": "Red & Yellow",
        "isbn": "9780620565158"
      },
      {
        "srNo": 6,
        "title": "Practical Web Analytics for User Experience: How Analytics Can Help You Understand Your Users",
        "author": "Michael Beasley",
        "publication": "Morgan Kaufmann; 1st edition (2013)",
        "isbn": "978-0124046191"
      }
    ],
    "websites": [
      {
        "title": "Google Digital Garage",
        "url": "https://learndigital.withgoogle.com/digitalgarage/courses?category=digital_marketing",
        "type": "Online Course Platform"
      },
      {
        "title": "SWAYAM - Digital Marketing Course 1",
        "url": "https://onlinecourses.swayam2.ac.in/ugc19_hs26/preview",
        "type": "Online Course Platform"
      },
      {
        "title": "SWAYAM - Digital Marketing Course 2",
        "url": "https://onlinecourses.swayam2.ac.in/cec23_mg08/preview",
        "type": "Online Course Platform"
      },
      {
        "title": "Digital Agency Network Case Studies",
        "url": "https://digitalagencynetwork.com/work/case-studies/",
        "type": "Case Studies"
      },
      {
        "title": "Google Analytics Case Studies",
        "url": "https://www.digitalvidya.com/blog/google-analytics-case-studies/",
        "type": "Web Analytics Case Studies"
      },
      {
        "title": "Facebook Business Learning",
        "url": "https://www.facebook.com/business/learn/courses",
        "type": "Social Media Marketing"
      },
      {
        "title": "SEO Tutorial - JavaTpoint",
        "url": "https://www.javatpoint.com/seo-tutorial",
        "type": "SEO Tutorial"
      },
      {
        "title": "SEO Search Ranking Guide",
        "url": "https://www.pageonepower.com/search-glossary/seo-search-ranking",
        "type": "SEO Resource"
      },
      {
        "title": "Open Link Profiler",
        "url": "https://openlinkprofiler.org/",
        "type": "Free backlink analysis tool to study competitor backlinks"
      }
    ]
  },
  "metadata": {
    "syllabusFormat": "new",
    "createdAt": "2024-09-09",
    "version": "1.0",
    "curriculumVersion": "2024-25"
  }
}