{
  "courseInfo": {
    "courseCode": "4311102",
    "subcode": "4311102",
    "courseTitle": "Fundamentals of Electronics",
    "subjectName": "Fundamentals of Electronics",
    "semester": "1",
    "program": "Electronics and Communication Engineering, Power Electronics",
    "branch": "Electronics and Communication Engineering, Power Electronics",
    "level": "Diploma",
    "curriculum": "COGC-2021",
    "academicYear": "w.e.f. 2024-25",
    "effFrom": "2024-25",
    "category": "Core",
    "departmentId": "11-ec",
    "programId": "11-ec",
    "departmentName": "Electronics and Communications Engineering",
    "programName": "Electronics and Communications Engineering"
  },
  "teachingExamScheme": {
    "teachingScheme": {
      "lecture": 4,
      "lectureHours": 4,
      "tutorial": 0,
      "tutorialHours": 0,
      "practical": 2,
      "practicalHours": 2,
      "credits": 5
    },
    "examinationScheme": {
      "theoryESE": 70,
      "theoryEseMarks": 70,
      "theoryCA": 30,
      "theoryPaMarks": 30,
      "practicalCA": 25,
      "practicalPaMarks": 25,
      "practicalESE": 25,
      "practicalEseMarks": 25,
      "totalMarks": 150
    },
    "courseFlags": {
      "isElective": false,
      "isTheory": true,
      "theoryExamDuration": "3 hours",
      "isPractical": true,
      "practicalExamDuration": "2 hours",
      "isFunctional": false,
      "isSemiPractical": false
    }
  },
  "rationale": "The engineering diploma holders are required to use and maintain various types of electronically controlled equipment. The fundamental principles of electronics are to be applied in most of the situations to arrive at the probable solutions which is faced in the world of work, therefore the knowledge of the functions of various basic electronic devices and components and practical skills acquired through the laboratory experiments will help them, when they work with electronic equipment and its sub-circuits. This course is designed to develop the skills to use the basics electronic components and apply the knowledge to maintain the various types of electronic circuits.",
  "competency": "Use principles of basic electronics to maintain various electronics circuits and equipment.",
  "courseOutcomes": [
    {
      "id": "CO1",
      "description": "Use basic active and passive electronic components."
    },
    {
      "id": "CO2",
      "description": "Develop different types of rectifiers using PN junction diode."
    },
    {
      "id": "CO3",
      "description": "Use special purpose diodes for different applications."
    },
    {
      "id": "CO4",
      "description": "Analyze various transistor configurations."
    },
    {
      "id": "CO5",
      "description": "Dispose electronic waste safely."
    }
  ],
  "underpinningTheory": [
    {
      "unitNumber": "I",
      "unitTitle": "Electronic Components",
      "unitOutcomes": [
        {
          "id": "1a",
          "description": "Compare active and passive components."
        },
        {
          "id": "1b",
          "description": "Explain the calculation of color coding technique for resistance calculation."
        },
        {
          "id": "1c",
          "description": "Compare specifications of various types of capacitors."
        },
        {
          "id": "1d",
          "description": "Differentiate various types of resistors, capacitors and Inductors on the basis of construction and working principle."
        },
        {
          "id": "1e",
          "description": "Describe the applications of given type of passive component."
        }
      ],
      "topics": [
        {
          "topicNumber": "1.1",
          "title": "Introduction to electronics, Brief History of electronic components, active and passive components"
        },
        {
          "topicNumber": "1.2",
          "title": "Resistors: Concept of resistors, specification of resistor, classification of resistors, fixed type and variable type resistors with applications, color coding of resistors, Light dependent resistor (LDR) - symbol and working"
        },
        {
          "topicNumber": "1.3",
          "title": "Capacitors: Concept of capacitor, Classification of capacitors, capacitors specifications, fixed capacitor, specification and application of ceramic disk capacitor, polyester capacitor, mica capacitor, aluminum electrolytic capacitor, tantalum capacitor, variable capacitor- application of air gang PVC gang and Trimmer capacitor - mica, Coding of capacitors using directly printed codes and color band system"
        },
        {
          "topicNumber": "1.4",
          "title": "Inductors: Faraday's laws of electromagnetic induction self-inductance, mutual inductance, inductor specifications, introduction to air core, iron core and ferrite core inductor, toroidal inductor, Color coding of inductors"
        }
      ]
    },
    {
      "unitNumber": "II",
      "unitTitle": "PN junction diode and Rectifiers",
      "unitOutcomes": [
        {
          "id": "2a",
          "description": "Describe the characteristics of PN junction diode."
        },
        {
          "id": "2b",
          "description": "Compare performance of various types of rectifiers."
        },
        {
          "id": "2c",
          "description": "Calculate ripple factor, ripple frequency, PIV and efficiency of the given type of rectifier."
        },
        {
          "id": "2d",
          "description": "Justify the selection of specific type of rectifier for the given application."
        },
        {
          "id": "2e",
          "description": "Discuss function of shunt capacitor and Pi-filter"
        }
      ],
      "topics": [
        {
          "topicNumber": "2.1",
          "title": "PN Junction diode: P-type and N-type semiconductor, construction of PN junction diode, symbol, working and characteristics of PN junction diode, Forward voltage drops, reverse leakage current, power dissipation, breakdown voltage, Peak inverse voltage (PIV)"
        },
        {
          "topicNumber": "2.2",
          "title": "Rectifier: Need of rectifier, definition, types of rectifiers"
        },
        {
          "topicNumber": "2.3",
          "title": "Half wave rectifier, full wave centre tap and bridge rectifier, output voltage, current, ripple voltage, ripple factor, ripple frequency, PIV of a diode, transformer utilization factor, efficiency of half wave and full wave rectifiers"
        },
        {
          "topicNumber": "2.4",
          "title": "Filters: Need and applications of rectifier filters, types of filters: shunt capacitor & Pie filter"
        }
      ]
    },
    {
      "unitNumber": "III",
      "unitTitle": "Special Purpose Diodes",
      "unitOutcomes": [
        {
          "id": "3a",
          "description": "Describe the working of the Zener voltage regulator circuit."
        },
        {
          "id": "3b",
          "description": "List applications of the given type of diode."
        },
        {
          "id": "3c",
          "description": "Describe working principle of LED."
        }
      ],
      "topics": [
        {
          "topicNumber": "3.1",
          "title": "Zener diode: Symbol, construction, characteristics and application as a voltage regulator"
        },
        {
          "topicNumber": "3.2",
          "title": "Symbol, construction, and application of Varactor diode, Schottky barrier diode, Crystal diode"
        },
        {
          "topicNumber": "3.3",
          "title": "Symbol, construction and application of Photodiode, Light Emitting Diode (LED) and Multi color LED"
        }
      ]
    },
    {
      "unitNumber": "IV",
      "unitTitle": "Introduction to Transistors",
      "unitOutcomes": [
        {
          "id": "4a",
          "description": "Describe working principle of PNP and NPN transistors with the help of suitable sketch."
        },
        {
          "id": "4b",
          "description": "Explain the operation of transistor for the given biasing between emitter base and collector."
        },
        {
          "id": "4c",
          "description": "Sketch the Input-output characteristics curve and calculate the current gain for the given transistor configuration."
        },
        {
          "id": "4d",
          "description": "Explain function of transistor as switch in cut off and application of saturation region."
        },
        {
          "id": "4e",
          "description": "Interpret transistor data-sheets"
        }
      ],
      "topics": [
        {
          "topicNumber": "4.1",
          "title": "Transistor NPN and PNP symbol, construction, working, amplifying action, important specifications of transistor"
        },
        {
          "topicNumber": "4.2",
          "title": "Transistor Configuration and input output characteristics of NPN transistors in Common base (CB), Common emitter (CE) and Common collector (CC) configuration"
        },
        {
          "topicNumber": "4.3",
          "title": "Relation between current gain of CB, CE and CC configuration, alpha, beta and gamma of transistor"
        },
        {
          "topicNumber": "4.4",
          "title": "Transistor as switch in cutoff and saturation region"
        },
        {
          "topicNumber": "4.5",
          "title": "Application of transistor as Common emitter amplifier"
        },
        {
          "topicNumber": "4.6",
          "title": "Interpret data sheets and choose transistor for given application based on polarity, material, Vcbo, Vceo, Icmax, hfe, Ft, Ptot (Power dissipation total) and package type (TO-3, SMT etc.)"
        }
      ]
    },
    {
      "unitNumber": "V",
      "unitTitle": "Handling Electronic Waste",
      "unitOutcomes": [
        {
          "id": "5a",
          "description": "Justify the need of electronic waste methods."
        },
        {
          "id": "5b",
          "description": "Establish the relationship between sustainability and electronic waste management."
        },
        {
          "id": "5c",
          "description": "Suggest methods of handling electronic waste."
        },
        {
          "id": "5d",
          "description": "Suggest methods to dispose electronic waste safely."
        }
      ],
      "topics": [
        {
          "topicNumber": "5.1",
          "title": "Concept of electronic waste"
        },
        {
          "topicNumber": "5.2",
          "title": "Sustainability and electronic waste management"
        },
        {
          "topicNumber": "5.3",
          "title": "Methods to handle electronic waste"
        },
        {
          "topicNumber": "5.4",
          "title": "Strategies of electronic waste management in the small electronics Industries"
        }
      ]
    }
  ],
  "practicalExercises": [
    {
      "srNo": 1,
      "description": "Use Digital Multimeter to measure basic electrical parameters like current, voltage and resistance.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 2,
      "description": "Use CRO to measure electrical parameters of different types of signals obtain from Function generator.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 3,
      "description": "Measure resistance, capacitances and inductances of different type of resistors, capacitors and inductors using LCR meter and verify it through color code and numerical code.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 4,
      "description": "Test the performance of LDR and measure the variation in resistance with the change in light intensity.",
      "unitNo": "I",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 5,
      "description": "Test the performance of PN junction diode and obtain forward Voltage drop and diode current.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 6,
      "description": "Build and test the half wave rectifier on a breadboard.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 7,
      "description": "Build and test the output of the full wave center tap rectifier on a breadboard.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 8,
      "description": "Build and test the full wave bridge rectifier on a breadboard.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 9,
      "description": "Test the performance of half and full wave rectifier with shunt capacitor filter.",
      "unitNo": "II",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 10,
      "description": "Test the performance of the zener diode and obtain the Zener breakdown (Reverse) voltage and current.",
      "unitNo": "III",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 11,
      "description": "Build and test zener voltage regulator for the given regulated voltage.",
      "unitNo": "III",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 12,
      "description": "Test the performance of LED in series and shunt connection and measure the current and voltage in both the connections.",
      "unitNo": "III",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 13,
      "description": "Test the performance of Photodiode and obtain reverse voltage drop and diode current with change in light intensity.",
      "unitNo": "III",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 14,
      "description": "Test common emitter transistor configuration and obtain the value of current gain and input impedance.",
      "unitNo": "IV",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 15,
      "description": "Test common base transistor configuration and obtain the value of current gain and input impedance.",
      "unitNo": "IV",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 16,
      "description": "Test common collector transistor configuration and obtain the value of current gain and input impedance.",
      "unitNo": "IV",
      "hours": 2,
      "isCompulsory": false
    },
    {
      "srNo": 17,
      "description": "Use transistor as switch.",
      "unitNo": "IV",
      "hours": 2,
      "isCompulsory": true
    },
    {
      "srNo": 18,
      "description": "Build and test common emitter amplifier and obtain the value of voltage gain for given input signal.",
      "unitNo": "IV",
      "hours": 2,
      "isCompulsory": true
    }
  ],
  "performanceIndicators": [
    {
      "indicator": "Prepare experimental setup.",
      "weightage": 20
    },
    {
      "indicator": "Follow the procedure to complete the connections and take readings.",
      "weightage": 20
    },
    {
      "indicator": "Follow safe practices measures.",
      "weightage": 10
    },
    {
      "indicator": "Record observations as per guidelines.",
      "weightage": 15
    },
    {
      "indicator": "Interpret the result and conclude the work.",
      "weightage": 35
    }
  ],
  "equipment": {
    "hardware": [
      "Dual variable DC power supply: 0-30V, 2A, With Short circuit protection, separate display for voltage and current",
      "Cathode Ray Oscilloscope: Dual Trace 20Mhz, 1MegaΩ Input Impedance",
      "Function Generator 0-2 MHz with Sine, square and triangular output with variable frequency and amplitude",
      "Digital Multimeter: 3 1/2 digit display, 1999 count digital multimeter measures: Vac, Vdc (600V max), Adc, Aac (10 amp max), Resistance (0 - 2 Mega Ohm), with diode and transistor tester",
      "LCR meter bench top or hand-held type, 3 1/2 digit LCD /LED display, 1999 count, Resistance 0-20 Mega Ohm, Capacitance 0-200 micro Farad, Inductance 0 - 20 Henry",
      "Electronic Workbench: Bread Board 840-1000 contact points: Positive and Negative DC power rails on opposite sides of the board with 0-30 V, 2 Amp Variable DC power supply, Function Generator 0-2MHz, CRO 0-30MHz, Digital Multimeter"
    ],
    "software": []
  },
  "affectiveDomainOutcomes": [
    "Work as a leader/a team member.",
    "Follow ethical practices.",
    "Practice environmentally friendly methods and processes.",
    "Follow safety precautions."
  ],
  "specificationTable": [
    {
      "unitNo": "I",
      "unitTitle": "Electronic Components",
      "teachingHours": 14,
      "rememberLevel": 6,
      "understandLevel": 4,
      "applyLevel": 6,
      "analyzeLevel": 0,
      "evaluateLevel": 0,
      "createLevel": 0,
      "totalMarks": 16
    },
    {
      "unitNo": "II",
      "unitTitle": "PN junction diodes and Rectifiers",
      "teachingHours": 14,
      "rememberLevel": 4,
      "understandLevel": 8,
      "applyLevel": 10,
      "analyzeLevel": 0,
      "evaluateLevel": 0,
      "createLevel": 0,
      "totalMarks": 22
    },
    {
      "unitNo": "III",
      "unitTitle": "Special purpose diodes",
      "teachingHours": 11,
      "rememberLevel": 2,
      "understandLevel": 6,
      "applyLevel": 6,
      "analyzeLevel": 0,
      "evaluateLevel": 0,
      "createLevel": 0,
      "totalMarks": 14
    },
    {
      "unitNo": "IV",
      "unitTitle": "Introduction to transistors",
      "teachingHours": 12,
      "rememberLevel": 2,
      "understandLevel": 4,
      "applyLevel": 6,
      "analyzeLevel": 0,
      "evaluateLevel": 0,
      "createLevel": 0,
      "totalMarks": 12
    },
    {
      "unitNo": "V",
      "unitTitle": "Handling Electronic Waste",
      "teachingHours": 5,
      "rememberLevel": 1,
      "understandLevel": 3,
      "applyLevel": 2,
      "analyzeLevel": 0,
      "evaluateLevel": 0,
      "createLevel": 0,
      "totalMarks": 6
    }
  ],
  "studentActivities": [
    "Prepare a table and interpret the technical specification of various diodes and transistors using data sheet.",
    "Prepare specifications of some electronic components.",
    "Collect information and seminar on any relevant topic related with the course.",
    "Undertake a market survey of different semiconductor components.",
    "Prepare a survey report different electronic waste management adopted by the local electronics industry.",
    "Undertake a survey of CPCB/GPCB authorized E-Waste handling agencies.",
    "Undertake a visit to e-waste handling plant nearby and prepare a report."
  ],
  "instructionalStrategies": [
    "Massive open online courses (MOOCs) may be used to teach various topics/sub topics.",
    "Guide student(s) in undertaking micro-projects.",
    "'L' in section No. 4 means different types of teaching methods that are to be employed by teachers to develop the outcomes.",
    "About 20% of the topics/sub-topics which are relatively simpler or descriptive in nature is to be given to the students for self-learning, but to be assessed using different assessment methods.",
    "With respect to section No.10, teachers need to ensure to create opportunities and provisions for co-curricular activities.",
    "Guide students on how to address issues on environment and sustainability",
    "Guide students for finding proper active and passive components using datasheet manuals and websites for electronic application"
  ],
  "microProjects": [
    {
      "title": "Diode",
      "description": "Build a circuit on general purpose PCB or breadboard to obtain +12V unregulated DC power supply using full wave bridge rectifier and filter (Duration: 8-10 hours)"
    },
    {
      "title": "Photodiode",
      "description": "Build a interruption detector circuit to blink an LED using LDR, and prepare a mini project report. (Duration: 6-8 hours)"
    },
    {
      "title": "Transistor Amplifier",
      "description": "a common emitter amplifier using transistor and prepare a mini project report. (Duration: 6-8 hours)"
    },
    {
      "title": "Transistor Application",
      "description": "Build a transistorized water level indicator and prepare a mini project report. (Duration: 6-8 hours)"
    },
    {
      "title": "Special Purpose Diodes",
      "description": "Build basic applications using any one or combination of special purpose diodes, and prepare a mini project report. (Duration: 6-8 hours)"
    },
    {
      "title": "Electronic Waste",
      "description": "Prepare a report of strategies regarding handling of electronic waste with figures, tables and comparative charts."
    }
  ],
  "learningResources": {
    "books": [
      {
        "srNo": 1,
        "title": "Basic Electronics and Linear Circuits",
        "author": "N.N. Bhargava, D.C. Kulshreshtha, S.C. Gupta",
        "publication": "McGraw Hill Education",
        "isbn": "9781259006463"
      },
      {
        "srNo": 2,
        "title": "Electronic Devices and Circuit: An Introduction",
        "author": "Mottershead, Allen",
        "publication": "Goodyear Publishing Co., New Delhi",
        "isbn": "9780876202654"
      },
      {
        "srNo": 3,
        "title": "The Art of Electronics",
        "author": "Horowitz, Paul; Hill, Winfield",
        "publication": "Cambridge University Press, New Delhi, 2015",
        "isbn": "9780521689175"
      },
      {
        "srNo": 4,
        "title": "Basic Electronic Engineering",
        "author": "Baru, V., Kaduskar, R., Gaikwad S.T.",
        "publication": "Dreamtech Press, New Delhi, 2015",
        "isbn": "9789350040126"
      },
      {
        "srNo": 5,
        "title": "Fundamentals of Electronic Devices and Circuits",
        "author": "Bell, David",
        "publication": "Oxford University Press New Delhi, 2015",
        "isbn": "9780195425239"
      },
      {
        "srNo": 6,
        "title": "Electronic Devices and Circuit",
        "author": "Maini, Anil K.",
        "publication": "Wiley India, New Delhi",
        "isbn": "9788126518951"
      },
      {
        "srNo": 7,
        "title": "Transistor Selector Handbook",
        "author": "TAB books",
        "publication": "Tower's International Foulsham, London, 1974",
        "isbn": "9780572008888"
      },
      {
        "srNo": 8,
        "title": "Principles of Electronics",
        "author": "V.K.Metha, Rohit Mehta",
        "publication": "S. Chand, New Delhi, 2014",
        "isbn": "978-8121924504"
      },
      {
        "srNo": 9,
        "title": "E-Waste: Management and Procurement of Environment",
        "author": "Suresh Kumar, Jatindra Kumar Pradhan",
        "publication": "Authors press 2021",
        "isbn": "B095PR6MVS"
      },
      {
        "srNo": 10,
        "title": "Solid and Liquid Waste Management Waste to Wealth",
        "author": "Rajaram Vasudevan, Siddiqui Faisal Zia, Agrawal Sanjeev",
        "publication": "PHI Learning Pvt. Ltd. New Delhi",
        "isbn": "9788120352452"
      }
    ],
    "websites": [
      {
        "title": "Datasheet Cafe",
        "url": "https://www.datasheetcafe.com",
        "type": "Technical Reference"
      },
      {
        "title": "Williamson Labs",
        "url": "https://www.williamson-labs.com",
        "type": "Technical Reference"
      },
      {
        "title": "Learners TV",
        "url": "https://www.learnerstv.com",
        "type": "Educational Platform"
      },
      {
        "title": "CadSoft",
        "url": "https://www.cadsoft.io",
        "type": "CAD Software"
      },
      {
        "title": "GTU Lectures",
        "url": "https://lectures.gtu.ac.in/listview.aspx?br=11&course=DI",
        "type": "Educational Platform"
      },
      {
        "title": "NPTEL",
        "url": "https://www.nptel.iitm.ac.in",
        "type": "Educational Platform"
      },
      {
        "title": "Khan Academy",
        "url": "https://www.khanacademy.org",
        "type": "Educational Platform"
      },
      {
        "title": "YouTube",
        "url": "https://www.youtube.com",
        "type": "Video Platform"
      },
      {
        "title": "All Datasheet",
        "url": "https://www.alldatasheet.com",
        "type": "Technical Reference"
      },
      {
        "title": "Electronics Tutorials",
        "url": "https://www.electronics-tutorials.ws",
        "type": "Technical Reference"
      },
      {
        "title": "Instructables - Basic Electronics",
        "url": "https://www.instructables.com/Basic-Electronics",
        "type": "Technical Reference"
      },
      {
        "title": "Maker Spaces Basic Electronics",
        "url": "https://www.makerspaces.com/basic-electronics",
        "type": "Technical Reference"
      },
      {
        "title": "Robu Electronic Components",
        "url": "https://robu.in/product-category/electronic-components/",
        "type": "Component Supplier"
      },
      {
        "title": "RS Components India",
        "url": "https://in.rsdelivers.com/campaigns/microsites/electronics",
        "type": "Component Supplier"
      },
      {
        "title": "Digi-Key India",
        "url": "https://www.digikey.in/",
        "type": "Component Supplier"
      },
      {
        "title": "Electronics Coach - Basic Electronics",
        "url": "https://electronicscoach.com/category/basic-electronics",
        "type": "Technical Reference"
      }
    ],
    "openSourceSoftware": [],
    "mobileApps": []
  },
  "competencyMapping": {
    "programOutcomes": [
      {
        "poNumber": "PO1",
        "description": "Basic & Discipline specific knowledge"
      },
      {
        "poNumber": "PO2",
        "description": "Problem Analysis"
      },
      {
        "poNumber": "PO3",
        "description": "Design/development of solutions"
      },
      {
        "poNumber": "PO4",
        "description": "Engineering Tools, Experimentation & Testing"
      },
      {
        "poNumber": "PO5",
        "description": "Engineering practices for society, sustainability & environment"
      },
      {
        "poNumber": "PO6",
        "description": "Project Management"
      },
      {
        "poNumber": "PO7",
        "description": "Life-long learning"
      }
    ],
    "mapping": [
      {
        "courseOutcome": "CO1",
        "poMappings": {
          "PO1": 3,
          "PO2": 2,
          "PO3": 1,
          "PO4": 3,
          "PO5": 0,
          "PO6": 2,
          "PO7": 1
        }
      },
      {
        "courseOutcome": "CO2",
        "poMappings": {
          "PO1": 3,
          "PO2": 1,
          "PO3": 2,
          "PO4": 2,
          "PO5": 1,
          "PO6": 1,
          "PO7": 0
        }
      },
      {
        "courseOutcome": "CO3",
        "poMappings": {
          "PO1": 3,
          "PO2": 1,
          "PO3": 2,
          "PO4": 2,
          "PO5": 1,
          "PO6": 1,
          "PO7": 1
        }
      },
      {
        "courseOutcome": "CO4",
        "poMappings": {
          "PO1": 3,
          "PO2": 1,
          "PO3": 2,
          "PO4": 2,
          "PO5": 0,
          "PO6": 0,
          "PO7": 0
        }
      },
      {
        "courseOutcome": "CO5",
        "poMappings": {
          "PO1": 3,
          "PO2": 1,
          "PO3": 1,
          "PO4": 2,
          "PO5": 3,
          "PO6": 1,
          "PO7": 1
        }
      }
    ]
  },
  "developmentCommittee": [
    {
      "name": "Bhadreshkumar B. Renuka",
      "designation": "",
      "institute": "A.V.P.T.I, Rajkot",
      "contact": "9426783082",
      "email": "renukasir@gmail.com"
    },
    {
      "name": "Satishkumar M. Kataria",
      "designation": "",
      "institute": "GP, Ahmedabad",
      "contact": "9998991632",
      "email": "smkataria.ec@gmail.com"
    },
    {
      "name": "Urja J. Shah",
      "designation": "",
      "institute": "GGP, Ahmedabad",
      "contact": "9979208337",
      "email": "urjashah2@gmail.com"
    },
    {
      "name": "Laukik K. Patel",
      "designation": "",
      "institute": "GP, Palanpur",
      "contact": "9033380983",
      "email": "laukiksky@gmail.com"
    },
    {
      "name": "Dr. Anjali Potnis",
      "designation": "Assistant Professor",
      "institute": "NITTTR Bhopal - Electrical & Electronics Engineering Education",
      "contact": "0755-2661600 *368",
      "email": "apotnis@nitttrbpl.ac.in"
    }
  ],
  "metadata": {
    "syllabusFormat": "old",
    "syllabusUrl": "http://syllabus.gtu.ac.in/",
    "createdAt": "2024-07-08T00:00:00Z",
    "updatedAt": "2024-07-08T00:00:00Z",
    "version": "1.0",
    "gtuSyllabusUrl": "http://syllabus.gtu.ac.in/",
    "curriculumVersion": "COGC-2021",
    "id": "4311102",
    "subjectCode": "4311102"
  }
}